# SetUnobscuredInView Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..SetUnobscuredInView Method
RebarContainer Class See Also
---
Sets this rebar container element to be shown unobscured in a view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetUnobscuredInView(
	View view,
	bool unobscured
)
```

Visual Basic
---
```text
Public Sub SetUnobscuredInView ( _
	view As View, _
	unobscured As Boolean _
)
```

Visual C++
---
```text
public:
void SetUnobscuredInView(
	View^ view,
	bool unobscured
)
```

# ### Parameters
view
    Type: Autodesk.Revit.DB..::..View The view element
unobscured
    Type: System..::..Boolean True if rebar is shown unobscured, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This rebar container element doesn't have valid visibility data. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace